[
  {
  "title": "MCP-Client-OpenSource",
  "category": "LATAM AI",
  "year": 2025,
  "description": "Developed under Consultor-IA.tech, this open-source MCP client enables custom AI agents to run on any device with a strong focus on privacy and security. Fully customizable and distributed, it integrates seamlessly with any workflow and supports LLMs like Gemini.",
  "src": "https://media.licdn.com/dms/image/v2/D4E22AQFFSg6zHO5UiQ/feedshare-shrink_800/B4EZexaCr9G4Ao-/0/1751028091337?e=1754524800&v=beta&t=SVxu17fLoR6qsEl7jKp9Va-6dmsOpuw5GkoOTG4Gu4s",
  "link": [
    {
      "src": "https://lnkd.in/eguYJ3sF",
      "text": "Live Demo"
    },
    {
      "src": "https://lnkd.in/eZsz-6P4",
      "text": "Documentation"
    }
  ]
},
  {
  "title": "Backend Developer",
  "category": "LSEG",
  "year": 2023,
  "description": "Developed a Retrieval-Augmented Generation (RAG) system to avoid code duplication and help developers find relevant solutions. Promoted and contributed to a RAG proof of concept leveraging knowledge graphs and large language models (LLMs). Authored documentation on how to integrate LLMs with Neo4j.",
  "src": "https://media.licdn.com/dms/image/C4E0BAQFbvN7ZxvT2CQ/company-logo_100_100/0/1650559162155?e=1756944000&v=beta&t=iqYs6DNwTw0H52gMCWv_Jcwc2tBDDe6zK_2FqX5hYxw",
  "link": [
    {
      "src": "https://medium.com/@thcookieh/how-i-created-a-neo4j-search-engine-with-generative-ai-98b43cf8ec1e",
      "text": "POC Documentation - Own resources"
    }
  ]
},
  {
    "title": "Cofounder",
    "category": "Consultor-IA",
    "year": 2023,
    "description": "Generated around half a million pesos in two-year work on AI-related projects from software development to AI consultancy and teaching. Built a multidisciplinary team to deliver solutions for businesses and professionals in Latin America. Collaborated with JhedAl and CENIA to develop Spanish-language LLMs and provide consultancy on their implementation and helped for project developments on international AI products. Led the development of Xook AI, a media digitization platform with features including news categorization, generative video creation, an interactive web app, and a WhatsApp bot newsletter, saving up to 1 million pesos in return of investment. Developed a suicide and depression awareness app with emotional face detection and reached semifinals at the Code Launch Mexico hackathon. Developed a law facilitator SaaS using Knowledge Graph RAGs for Latin America with direct integration with court resolutions, tested for Mexico and Venezuela. Implemented data infrastructure and AI solutions for human resources and marketing projects using semantic search, GPT models, VertexAI, and HuggingFace. Helped Process Tempo to implement a 100% functional LLM system for text-to-report creation. Participated in Google Developer Groups, universities, and forums in Mexico, Colombia, and Chile. Participated as juror on two Tecnológico de Monterrey events like Hult Prize and Fin4All on Querétaro campus. Worked alongside Bloom Legal on CRM Development. Provided consultancy to technological projects in Yucatán, Querétaro, Ciudad de México, Sonora, San Luis Potosí, and supported international projects in Chile, Colombia, Peru, and Ecuador on AI audits from legal and ethical perspectives.",
    "src": "https://media.licdn.com/dms/image/v2/D4E0BAQFRqPIwmVQO0w/company-logo_100_100/0/1710884351612?e=1756944000&v=beta&t=W8FqTdBQqj7PcGxgTBo8_kzT64fcZvmcH1CP5IfGXUY",
    "link": [
      {
        "src": "https://www.linkedin.com/company/consultor-ia-tech",
        "text": "Consultor-IA.tech"
      }
    ]
  },
  {
    "title": "NASA AI HACKATHON",
    "category": "Nasa Space Missions",
    "year": 2023,
    "description": "Participating in the NASA AI Hackathon, I led a team of 5 in developing a novel RAG-based methodology for evaluating resource consumption and ensuring adherence to NASA's stringent safety protocols for crewed space missions. Our solution employed a virtual assistant that could intelligently compare ship standards and sensor readings against established guidelines, providing real-time feedback and alerts. To achieve this, we built a custom knowledge graph within an impressive 24-hour timeframe, demonstrating our ability to rapidly develop and deploy complex AI systems under pressure.",
    "src": "./playground_assets/galactic.jpg",
    "link": [
      {
        "src": "https://medium.com/@thcookieh/my-experience-at-nasa-hackathon-2023-6b1861dc9472",
        "text": "Learn More Here"
      }
    ]
  },
  {
    "title": "Mirai Innovation Representative",
    "category": "Research and Development",
    "year": 2023,
    "description": "Serving as an AI mentor and speaker for Mirai Innovation, a prominent R&D company specializing in neuroscience with a global presence in Mexico and Japan, I engaged in various activities, including participating in events, conducting media interviews, presenting at conferences, and delivering university lectures across Mexico. I also spearheaded the development of AI applications for the Mexican government, contributing to the advancement of AI adoption in the public sector. Additionally, I was invited to Japan to conduct over 10 workshops at EMFUTECH 2023, where I shared my expertise on a wide range of AI topics, including Ethical AI, Machine Learning, Reinforcement Learning, Deep Learning, Computer Vision, Natural Language Processing and Generation with LLMs, and MLOps.",
    "src": "https://www.youtube.com/embed/I8s1B7-Ra9o",
    "link": [
      {
        "src": "https://www.mirai-innovation-lab.com/emfutech-japan-2023/",
        "text": "Learn More Here"
      },
      {
        "src": "https://www.youtube.com/shorts/Gcjlz4APKxo",
        "text": "My 10 Workshops"
      },
      {
        "src": "https://www.youtube.com/watch?v=U-yBA6DEisg&ab_channel=TheHappyCookieHour",
        "text": "Radio Interview"
      }
    ]
  },
  {
    "title": "FruitFul Life",
    "category": "Psicology",
    "year": 2023,
    "description": "Fruitful Life is a passion project aimed at leveraging AI to understand and support individuals' emotional well-being. The project focuses on identifying emotional trends and providing personalized advice, motivational content, and tools for self-reflection. With a strong emphasis on suicide and depression awareness, the app empowers users to easily identify their feelings through facial emotion recognition technology, create personalized phrases and images that reflect their mood, and connect with resources for support. Fruitful Life achieved significant recognition by reaching the semifinals of Mexico's first Codelaunch competition, highlighting its potential to make a positive impact on mental health.",
    "src": "https://www.youtube.com/embed/w_4s3A65Iss",
    "link": [
      {
        "src": "https://medium.com/@thcookieh/fruitful-life-a-new-way-to-treat-depression-in-mexico-c7d61f0a24ed",
        "text": "Project Justification and Documentation"
      },
      {
        "src": "https://www.linkedin.com/posts/chrisgalleta_codelaunch-activity-7081691918463631360-zXlC?utm_source=share&utm_medium=member_desktop",
        "text": "Codelaunch Mexico semifanalist"
      }
    ]
  },
  {
    "title": "Sonora and Queretaro GDG, and others in Mexico",
    "category": "AI Speaker",
    "year": 2023,
    "description": "As a sought-after AI speaker, I had the privilege of sharing my knowledge and experiences with diverse audiences across Mexico, including events organized by Sonora GDG and other groups in various states such as Sonora, Guerrero, and Querétaro. My speaking engagements covered a wide range of topics, drawing from my professional journey, including developing high-demand projects in Japan, optimizing software development processes to reduce time-to-market, leveraging Vertex AI for building LLM-powered applications, and showcasing my personal AI projects.",
    "src": "https://www.youtube.com/embed/AJ1rG6ZATP4",
    "link": [
      {
        "src": "https://gdg.community.dev/events/details/google-gdg-hermosillo-presents-gdg-hermosillo-react-firebase-and-ai-with-gcloud/",
        "text": "Learn More Here"
      },
      {
        "src": "https://www.youtube.com/watch?v=Tgg2SludF38&list=PLnv6QfOebpsJFhWvHjUeMX7oC521725Vx&ab_channel=TheHappyCookieHour",
        "text": "Playlist of talks"
      }
    ]
  },
  {
    "title": "IEU Marketing Analysis",
    "category": "Digital Marketing",
    "year": 2023,
    "description": "For IEU University, a rapidly growing online university, I developed a sophisticated solution to transform unstructured data into actionable insights about the institution's performance. This involved utilizing vector similarity techniques with embedding models, Markov chains, and emotion detection to efficiently analyze a substantial dataset of 11,000 records in just 20 seconds. The resulting insights provided IEU University with valuable information for strategic decision-making and continuous improvement.",
    "src": "./playground_assets/ieu.png",
    "link": [
      {
        "src": "https://ieu.edu.mx/",
        "text": "Universidad IEU website"
      }
    ]
  },
  {
    "title": "AI-Based automatic idea generator for social media",
    "category": "Digital Marketing",
    "year": 2023,
    "description": "This project garnered national recognition in Mexico and was developed for The DECK, a Japanese company. The primary objective was to address the challenge of monotonous content creation faced by social media community managers. Our AI-powered solution automatically generates fresh and engaging social media content ideas by leveraging similarity and engagement analysis through embedded systems and a custom-built embedding model. The system intelligently produces relevant ideas aligned with popular and trending topics, empowering community managers to create more impactful content. The project's success led to its re-engineering for enhanced speed and cost-effectiveness, securing further funding in Mexico. Notably, the project received widespread attention and was featured by prominent organizations such as the Secretaría de Educación Pública (SEP), the Secretaría de Relaciones Exteriores, and numerous news outlets and social media platforms across Mexico.",
    "src": "https://www.youtube.com/embed/ZgW3N6i3PzE",
    "link": [
      {
        "src": "https://www.canva.com/design/DAFTcPvmwnM/WdJcNTxi7a7oirchuBYBrQ/edit?utm_content=DAFTcPvmwnM&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton",
        "text": "Project Overview"
      },
      {
        "src": "https://medium.com/@thcookieh/how-i-created-my-own-embedding-system-and-won-a-prize-in-japan-357a32f64fa9",
        "text": "National Project Relevancy"
      }
    ]
  },
  {
    "title": "Brain Based dynamic art studio to generate Smart Contracts using emotional analysis",
    "category": "Research and Development",
    "year": 2023,
    "description": "This innovative project seamlessly blends art, AI, and neuroscience to create a unique and expressive experience. It addresses the common challenge of individuals struggling to express their emotions effectively by providing a virtual reality environment where users can create dynamic art based on their feelings. The system utilizes a sophisticated emotion detection model and generative AI techniques to translate emotions into artistic expressions. The resulting art pieces can then be stored as NFTs on the blockchain, opening up new creative possibilities in the realm of digital art.",
    "src": "https://www.youtube.com/embed/1qFb25Dbn9c",
    "link": [
      {
        "src": "https://www.youtube.com/shorts/xk-o9SL6oFQ",
        "text": "Learn More Here"
      }
    ]
  },
  {
    "title": "EMFUTECH 2022",
    "category": "Research and Development",
    "year": 2022,
    "description": "EMFUTECH is a prestigious training program focused on emerging technologies. I was selected as one of the top 18 participants out of over 80 applicants from Mexico in 2022. During my 3-month stay in Japan, I immersed myself in intensive workshops covering a wide spectrum of cutting-edge technologies, including Robotics, Nanosatellites, Aerospace, Aerial-Earth-Aquatic Robots, Augmented Reality (AR), Virtual Reality (VR), Blockchain, Cloud Computing, Design Thinking, Bioprinting, Nanotechnology, Electroencephalograms (EEGs), and Artificial Intelligence. I achieved the distinction of successfully completing two projects during the program, a feat rarely accomplished by participants. These projects included the design, creation, and deployment of an award-winning AI-based automatic idea generator for social media and the development of a brain-based dynamic art studio for generating NFT art.",
    "src": "https://www.youtube.com/embed/FvSprWxMHnU",
    "link": [
      {
        "src": "https://issuu.com/diarioplazajuarez_/docs/06-03-23/13?fbclid=IwAR3ZVVsLgvqoYIEjlsR-oMnnhgge0k8MzhSL_G7reMgwlbLgdnOeURmlSt8",
        "text": "Research Magazine interview"
      }
    ]
  },
  {
    "title": "Text2Neo4j",
    "category": "Ciber Security",
    "year": 2022,
    "description": "At Process Tempo, a graph data warehouse and analytics platform, I played a key role in analyzing data, creating interactive dashboards and KPIs, and migrating data to a cloud-based environment. For Ford Motor Company, a client utilizing the React First cybersecurity framework, I developed NLP-NLG solutions such as Text2Code for generating Neo4j queries from natural language text, automated natural report creation and interaction, and a Personal Identifiable Information (PII) Detector to prevent data breaches in APIs.",
    "src": "./playground_assets/text-to-code.jpg",
    "link": [
      {
        "src": "https://medium.com/@thcookieh/llm-conquers-everyone-sooner-or-later-afee15116ea5",
        "text": "2024 On Prem deployment of solution"
      }
    ]
  },
  {
    "title": "Creolio",
    "category": "Education",
    "year": 2021,
    "description": "Creolio is an innovative language learning platform designed with the principle that students learn a new language more effectively by focusing on the most frequently used words first. It caters to individuals who are starting their language learning journey from scratch, employing spaced repetition techniques to reinforce learning of the most to least frequent words through various media such as songs, books, and user-selected content. The system is built using the Django framework with an MVC architecture and incorporates data analytics and NLP techniques to personalize user learning rates and optimize word presentation.",
    "src": "./playground_assets/creolio.jpg",
    "link": [
      {
        "src": "https://www.linkedin.com/in/chrisgalleta/",
        "text": "Learn more on my LinkedIn"
      }
    ]
  },
  {
    "title": "Lia - La Inteligencia Artificial",
    "category": "Research and Development",
    "year": "2020-2021",
    "description": "At Anuka, a language learning startup, I developed Lia, an AI-powered chatbot that provides contextually relevant grammar examples, lemmatization, synonyms, and exercises to language learners. By leveraging spaced repetition, Lia facilitates faster and more personalized learning experiences. A key challenge I addressed was reducing the memory consumption of certain Spacy modules, leading me to research and implement state-of-the-art solutions. This project marked my initial foray into the world of Natural Language Processing (NLP) and Large Language Models (LLMs), providing valuable insights into the capabilities and limitations of transformers and the effective utilization of data and resources in NLP.",
    "src": "https://www.youtube.com/embed/GRFLl9qk8Cc",
    "link": [
      {
        "src": "https://youtube.com/shorts/A1m5BzWK1NM?si=ZO_J1n-ppdS1Nc1W",
        "text": "Learn More Here"
      },
      {
        "src": "https://medium.com/@thcookieh/from-zero-to-hero-my-beginnings-in-generative-ai-610f495276be",
        "text": "Project Overview"
      }
    ]
  }
]
