[
  {
    "title": "AI POC Developer",
    "category": "Research and Development",
    "year": 2024, 
    "description":"At LSEG (London Stock Exchange Group), within the Pattern Library Engineering team, I spearheaded the integration of cloud architecture and led the development of AI solutions leveraging Large Language Models (LLMs). My key achievement was the delivery of a proof-of-concept Retrieval-Augmented Generation (RAG) system using Neo4j as the knowledge graph database and an LLM for natural language understanding and generation. This involved implementing vector indexing for efficient retrieval of relevant information. The successful POC led to a research study focused on quantifying the time and cost benefits of utilizing LLMs for search and data analysis. Furthermore, I developed a search and recommendation engine that incorporated data reasoning capabilities, enabling more intelligent and context-aware results. This project was completed within a tight one-month timeframe.",
    "src": "./playground_assets/lseg.png",
    "link": [
      {
        "src": "https://medium.com/@thcookieh/how-i-created-a-neo4j-search-engine-with-generative-ai-98b43cf8ec1e",
        "text": "RAG POC for LSEG"
      }
    ]
  },
  {
    "title": "AI Consultant",
    "category": "Research and Development",
    "year": 2023,
    "description": "As an AI consultant, I partnered with various clients to develop and deploy cutting-edge AI solutions tailored to their specific needs. I specialized in leveraging the power of LLMs and deep neural network architectures to create innovative and cost-effective applications. Some notable examples include:HR Candidate Selection System: Developed an AI-powered system that analyzed resumes, job descriptions, and other relevant data to identify the most qualified candidates for any given position, streamlining the recruitment process and improving hiring efficiency.Text-to-Code to On-Premise LLM Solution: Transformed an existing text-to-code solution into a fully functional, on-premise LLM deployment, empowering clients to generate code from natural language descriptions, accelerating software development and reducing manual effort.Enhanced Legal Research for Mexican Citizens: Created a custom legal database enriched with AI capabilities, enabling Mexican citizens to easily access and understand complex legal information, fostering greater transparency and access to justice.Automated News Reporting: Developed a system that leverages text categorization and generative AI to create fully automated news reports, reducing the time required for news production from 5 hours to just 5 minutes, significantly improving efficiency and content delivery speed",
    "src": "./playground_assets/aitana.png",
    "link": [
      {
        "src": "https://medium.com/@thcookieh/aitana-a-generative-ai-success-story-34db2972c0fb",
        "text": "Aitana News Project"
      },
      {
        "src": "https://www.youtube.com/watch?v=N91gM0kUHP4&list=PLnv6QfOebpsKsf9tSfjA0aMZye8NEKsoN&index=5&t=127s&ab_channel=Ciadet",
        "text": "CIADET - Colombia interview"
      }
    ]
  },
  {
    "title": "NASA AI HACKATHON",
    "category": "Nasa Space Missions",
    "year": 2023,
    "description": "Participating in the NASA AI Hackathon, I led a team of 5 in developing a novel RAG-based methodology for evaluating resource consumption and ensuring adherence to NASA's stringent safety protocols for crewed space missions. Our solution employed a virtual assistant that could intelligently compare ship standards and sensor readings against established guidelines, providing real-time feedback and alerts. To achieve this, we built a custom knowledge graph within an impressive 24-hour timeframe, demonstrating our ability to rapidly develop and deploy complex AI systems under pressure.",
    "src": "./playground_assets/galactic.jpg",
    "link": [
      {
        "src": "https://medium.com/@thcookieh/my-experience-at-nasa-hackathon-2023-6b1861dc9472",
        "text": "Learn More Here"
      }
    ]
  },
  {
    "title": "Mirai Innovation Representative",
    "category": "Research and Development",
    "year": 2023,
    "description": "Mirai Innovation is an R&D company, leaders in Neuroscience Research in Mexico with presence in Japan. Invited to work as an AI mentor, and speaker in events, news media interviews, congresses, and universities in Mexico. Leading development of AI applications for Government. Invited to Japan to give +10 Workshops in EMFUTECH 2023, covering topics from Ethical AI, Machine Learning, Reinforcement Learning, Deep Learning, Computer Vision, Natural Language Processing and Generation with LLM, and MLOps.",
    "src": "https://www.youtube.com/embed/I8s1B7-Ra9o",
    "link": [
      {
        "src": "https://www.mirai-innovation-lab.com/emfutech-japan-2023/",
        "text": "Learn More Here"
      },
      {
        "src": "https://www.youtube.com/shorts/Gcjlz4APKxo",
        "text": "My 10 Workshops"
      },
      {
        "src": "https://www.youtube.com/watch?v=U-yBA6DEisg&ab_channel=TheHappyCookieHour",
        "text": "Radio Interview"
      }
    ]
  },
  {
    "title": "FruitFul Life",
    "category": "Psicology",
    "year": 2023,
    "description": "Fruitful Life is our proposal to understand emotional trends from users and help them through advices, motivational phrases and delivering a way to connect with oneself giving a name to what you feel. We want to help as many people as possible, giving suicide and depression awareness. You can check your feelings with facial emotional recognition. With a picture of yourself, label easilly what you feel and according to it, create a phrase and a picture using your mood. Second time on contest, got to semifinals on Mexico's first Codelaunch.",
    "src": "https://www.youtube.com/embed/w_4s3A65Iss",
    "link": [
      {
        "src": "https://medium.com/@thcookieh/fruitful-life-a-new-way-to-treat-depression-in-mexico-c7d61f0a24ed",
        "text": "Project Justification and Documentation"
      },
      {
        "src": "https://www.linkedin.com/posts/chrisgalleta_codelaunch-activity-7081691918463631360-zXlC?utm_source=share&utm_medium=member_desktop",
        "text": "Codelaunch Mexico semifanalist"
      }
    ]
  },
  {
    "title": "Sonora GDG, and others in Mexico",
    "category": "AI Speaker",
    "year": 2023,
    "description": "Invited in Sonora, Guerrero, Querétaro, and other mexican states to talk about different topics, from my experience developing a high demand project in Japan; teaching how to reduce Development time from 45 days to 7 days; how to use Vertex AI to create an LLM app; and my own personal projects.",
    "src": "https://www.youtube.com/embed/AJ1rG6ZATP4",
    "link": [
      {
        "src": "https://gdg.community.dev/events/details/google-gdg-hermosillo-presents-gdg-hermosillo-react-firebase-and-ai-with-gcloud/",
        "text": "Learn More Here"
      },
      {
        "src": "https://www.youtube.com/watch?v=Tgg2SludF38&list=PLnv6QfOebpsJFhWvHjUeMX7oC521725Vx&ab_channel=TheHappyCookieHour",
        "text": "Playlist of talks"
      }
    ]
  },
  {
    "title": "IEU Marketing Analysis",
    "category": "Digital Marketing",
    "year": 2023,
    "description": "IEU University is a full Online University with growing prestige; required a solution that could transform unstructured data into insights about the college performance. Presented a solution that used Vector similarity using Embedding models, Markov Chains, and Emotion Detection to synthesize and analyse 11 thousand registries in 20 seconds.",
    "src": "./playground_assets/ieu.png",
    "link": [
      {
        "src": "https://ieu.edu.mx/",
        "text": "Universidad IEU website"
      }
    ]
  },
  {
    "title": "AI-Based automatic idea generator for social media",
    "category": "Digital Marketing",
    "year": 2023,
    "description": "Project with national relevancy in Mexico. This project was a Cloud AI-based automatic idea generator for social media made for the Japanese company: The DECK. Community managers become monotonous and may lack creativity when generating content for social media. Because of that, we developed a recommendation system based on similarity and engagement using Embedded Systems for vector similarity + our own embedding model. The solution generated interesting ideas that fit popular topics in their social media + relevant topics and news. The project was retaken and redone in 7 days; creating a faster and computational cheaper solution to raise founding in Mexico. Mentioned by Secretaría de Educación Pública (SEP), Secretaria de Relaciones Exteriores, many TV news programs, newspapers and social media in Mexico.",
    "src": "https://www.youtube.com/embed/ZgW3N6i3PzE",
    "link": [
      {
        "src": "https://www.canva.com/design/DAFTcPvmwnM/WdJcNTxi7a7oirchuBYBrQ/edit?utm_content=DAFTcPvmwnM&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton",
        "text": "Project Overview"
      },
      {
        "src": "https://medium.com/@thcookieh/how-i-created-my-own-embedding-system-and-won-a-prize-in-japan-357a32f64fa9",
        "text": "National Project Relevancy"
      }
    ]
  },
  {
    "title": "Brain Based dynamic art studio to generate Smart Contracts using emotional analysis",
    "category": "Research and Development",
    "year": 2023,
    "description": "People often struggle expressing emotions and lack of time to learn new techniques to do so. Moreover, modern technologies are difficult to master for the general audience in order to express meaningful ideas. This project gave meaning to AI Art, NFTs, and Electro Encephalograms (EEG); and direction to use them as a tool and not the end result. My Brain Machine Interface (BMI) Art Studio, transforms a VR environment and your paintings with your emotions. That way, people can create art by using their fellings, to later store them in the blockchain. With the use of AI, people can paint with image2image models, transform their final outcome with an emotion, and change their Virtual Reality Art studio with their mood. The emotion detection is done with a Time Series Classification that can identify 3 cognitive states (Positive, Neutral and Negative).",
    "src": "https://www.youtube.com/embed/1qFb25Dbn9c",
    "link": [
      {
        "src": "https://www.youtube.com/shorts/xk-o9SL6oFQ",
        "text": "Learn More Here"
      }
    ]
  },
  {
    "title": "EMFUTECH 2022",
    "category": "Research and Development",
    "year": 2022,
    "description": "EMFUTECH trainning program let's you learn from the best teachers in Japan, Europe and Mexico about new emerging technologies and create innovative projects. Selected among 18 best from +80 applicants from Mexico in 2022. Being in Japan for 3 Months working on workshops about: Robotics, Nanosatellites, Aerospace, Aerial-Earth-Aquatic Robots, AR, VR, Blockchain, Cloud computing, Design Thinking, Bioprinting, Nanotechnology, Electroencephalograms, and Artificial Inteligence. Successfully completed two projects (achievement for first time someone does it in the program): Designed, Created, and Deployed an AI-Based automatic idea generator for social media (award winning), and a Brain Based dynamic art studio to generate NFT art.",
    "src": "https://www.youtube.com/embed/FvSprWxMHnU",
    "link": [
      {
        "src": "https://issuu.com/diarioplazajuarez_/docs/06-03-23/13?fbclid=IwAR3ZVVsLgvqoYIEjlsR-oMnnhgge0k8MzhSL_G7reMgwlbLgdnOeURmlSt8",
        "text": "Research Magazine interview"
      }
    ]
  },
  {
    "title": "Text2Neo4j",
    "category": "Ciber Security",
    "year": 2022,
    "description": "Process Tempo is a Graph data wharehouse and an Analytics Platform that brings value to data using graph databases, adding more meaning to their relationships. 80% of my time was used in analyzing and creating dashboards, KPI’s and migrating all data on a Cloud based environment, 20% doing R&D. We had as a client Ford Motor Company on the Cyber security “React First” use case. I added value to the company through NLP-NLG solutions such as Text2Code generation from text to Neo4j, doing natural report creation and interaction; and a Personal Identificable Information (PII) Detector to avoid data breaches on APIs.",
    "src": "./playground_assets/text-to-code.jpg",
    "link": [
      {
        "src": "https://medium.com/@thcookieh/llm-conquers-everyone-sooner-or-later-afee15116ea5",
        "text": "2024 On Prem deployment of solution"
      }
    ]
  },
  {
    "title": "Creolio",
    "category": "Education",
    "year": 2021,
    "description": "Anuka's second project. The idea behind creolio resides that students learn a new language by teaching the most frequent words first. This project is created for people who want to learn new languages from scratch by learning, through spaced repetition, the most frequent words to the least frequent using songs, books and other media of their choice. The system is designed fully in Django with a MVC architecture, and powered with data analytics and NLP techniques to decide user learning rates and which words to display.",
    "src": "./playground_assets/creolio.jpg",
    "link": [
      {
        "src": "https://www.linkedin.com/in/chrisgalleta/",
        "text": "Learn more on my LinkedIn"
      }
    ]
  },
  {
    "title": "Lia - La Inteligencia Artificial",
    "category": "Research and Development",
    "year": "2020-2021",
    "description": "I first started working for Anuka, a Language Learning startup that provides an environment for medium to advance language learners using Natural Language Processing. According to context, delivered grammar examples, lematization, synonyms, and exercises. Based on Spaced Repetition users could learn faster and at their own pace. They required to decrease the memory consumption of certain Spacy modules, which led to researching for state of the art solutions. Lead R&D for 3 months and created Lia. The result of combining Facebook chats and GPT-2 open source model. My first entrance into NLP and LLMs. Allowed to learn limitations and capabilities from transformers, use and consumptions of data and resources.",
    "src": "https://www.youtube.com/embed/GRFLl9qk8Cc",
    "link": [
      {
        "src": "https://youtube.com/shorts/A1m5BzWK1NM?si=ZO_J1n-ppdS1Nc1W",
        "text": "Learn More Here"
      },
      {
        "src": "https://medium.com/@thcookieh/from-zero-to-hero-my-beginnings-in-generative-ai-610f495276be",
        "text": "Project Overview"
      }
    ]
  }
]
